БухЭксп/DataProcessors/CW_ПФ_СправкаКАкту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПФ_СправкаКАкту</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РасходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РасходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ДоходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ДоходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Comment>Актируемый счёт</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеестрыНДС0Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоставГруппУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоставГруппУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПФ_СправкаКАкту/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Справка к акту";
	СтруктураОписания.Описание 					= "Справка к акту";
	
	СтруктураОписания.Версия					= "3.2.8.2";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.8";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции 

Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Справка к акту"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);

КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= СсылкаНаОбъект.Дата;
	СтруктураПараметровДоговора.Договор 			= СсылкаНаОбъект.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора,"ФормироватьСправку");
	
	Возврат СсылкаНаОбъект.ФормируетсяАкт И ПараметрыДоговора.ФормироватьСправку;
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Использование = Ложь;
	
	Если ТипЗнч(КонтекстВызова) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметровДоговора.Дата 				= СсылкаНаОбъект.Дата;
		СтруктураПараметровДоговора.Договор 			= СсылкаНаОбъект.Договор;
		СтруктураПараметровДоговора.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора,"ФормироватьСправку");
		Использование 		=  СсылкаНаОбъект.ФормируетсяАкт И ПараметрыДоговора.ФормироватьСправку
		
	КонецЕсли;
	
	Возврат Использование;
	
КонецФункции
// информация об обработке


//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;
	
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();

	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= СсылкаНаОбъект.Дата;
	СтруктураПараметровДоговора.Договор 			= СсылкаНаОбъект.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
	
	ВыводитьПоказателиСправкиВВалютеДокумента = ПараметрыДоговора.ВыводитьПоказателиСправкиВВалютеДокумента;
	
	//Параметр дополнительной группировки
	ПараметрДополнительнойГруппировки = ПараметрыДоговора.ПараметрДополнительнойГруппировкиСправкиКАкту;
	ВыводитьПараметрДополнительнойГруппировки = ЗначениеЗаполнено(ПараметрДополнительнойГруппировки);
	//Параметр дополнительной группировки
	
	// Параметры макета
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Макет = ПолучитьМакет("Справка");
	// Параметры макета
	
	ВалтаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ПредставлениеВалюты = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(ВалтаРегУчета);
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозке.Организация КАК Организация,
	|	CW_ДоходыПоГрузоперевозке.Контрагент КАК Контрагент,
	|	CW_ДоходыПоГрузоперевозке.Договор КАК Договор,
	|	CW_ДоходыПоГрузоперевозке.НомерАкта КАК НомерАкта,
	|	CW_ДоходыПоГрузоперевозке.ДатаАкта КАК ДатаАкта,
	|	CW_ДоходыПоГрузоперевозке.Валюта КАК Валюта,
	|	CW_ДоходыПоГрузоперевозке.Дата КАК Дата
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	ВыборкаШапка.Следующий();
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(ВыборкаШапка.Организация, ВыборкаШапка.Дата);
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(ВыборкаШапка.Контрагент, ВыборкаШапка.Дата);
	
	//Шапка отчета
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Организация 	= НаименованияОрганизации.НаименованиеДляПечатныхФорм;
	ОбластьШапка.Параметры.Покупатель 	= НаименованияКонтрагента.НаименованиеДляПечатныхФорм;
	ОбластьШапка.Параметры.Договор 		= ВыборкаШапка.Договор;
	
	СтурктаНомерНаПечета = Новый Структура("Организация,Дата,НомерАкта");
	ЗаполнитьЗначенияСвойств(СтурктаНомерНаПечета, ВыборкаШапка);
	
	ПредставлениеФормы = "Справка к акту №"+ CW_Документы.ПолучитьНомерНаПечать(СтурктаНомерНаПечета, "НомерАкта")+" от "+Формат(ВыборкаШапка.ДатаАкта, "ДФ=dd.MM.yyyy");
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеФормы));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	СтурктаНомерНаПечета);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ВыборкаШапка.ДатаАкта);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	ЗаголовокФормы = "СПРАВКА К АКТУ №"+ CW_Документы.ПолучитьНомерНаПечать(СтурктаНомерНаПечета, "НомерАкта")+" от "+Формат(ВыборкаШапка.ДатаАкта, "ДФ='dd MMMM yyyy ""г.""'");
	ОбластьШапка.Параметры.ЗаголовокФормы = ЗаголовокФормы;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	//Шапка отчета    
	
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуСправкиКАкту Тогда
		ОбластьДополнительно = Макет.ПолучитьОбласть("Дополнительно");
		ОбластьДополнительно.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСправкиКАкту, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		
		ТабличныйДокумент.Вывести(ОбластьДополнительно);
	КонецЕсли;	
	// дополнительно
	
	//Курс перерасчета
	КурсПерерасчета = ПолучитьКурсПересчетаПоТекущемуДокументу();
	
	мПеревыставление = Новый Массив;
	мПеревыставление.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
	мПеревыставление.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор",	 	СсылкаНаОбъект);
	Запрос.УстановитьПараметр("КурсПерерасчета", 	КурсПерерасчета);
	Запрос.УстановитьПараметр("мПеревыставление", 	мПеревыставление);
	
	Запрос.УстановитьПараметр("Параметр", 	ПараметрДополнительнойГруппировки);
	Запрос.УстановитьПараметр("ВыводитьПараметрДополнительнойГруппировки", 	ВыводитьПараметрДополнительнойГруппировки);
	
	Запрос.УстановитьПараметр("Контрагент", 			СсылкаНаОбъект.Контрагент);
	Запрос.УстановитьПараметр("Договор", 				СсылкаНаОбъект.Договор);
	Запрос.УстановитьПараметр("ПриложениеКДоговору", 	СсылкаНаОбъект.ПриложениеКДоговору);
	
	//ЗАПРОСЫ
	ДополнитьВЗапросДанныеПоДоходам(Запрос);
	ДополнитьВЗапросДанныеПоПеревыставляемымЗатратам(Запрос);
	ПодготовитьГруппыУслугДляполученияПрямыхЗатрат(Запрос);
	ПолучитьПрямыеЗатраты(Запрос);
	ПолучитьРасходныеДокументыКАкту(Запрос);
	ДополнитьВЗапросИтогиПоРасходнымДокументам(Запрос);
	ПодготовитьДанныеВходящихДокументов(Запрос);
	ПодготовитьВходящиеДанные(Запрос);
	//ЗАПРОСЫ
	
	
	//КОНТРОЛЬ НАЛИЧИЯ ДОКУМЕНТОВ
	ПроверитьНаличиеВходящихДокументов(Запрос);
	//КОНТРОЛЬ НАЛИЧИЯ ДОКУМЕНТОВ
	
	
	//СЧИТАЕМ КОЛИЧЕСТВО ВАЛЮТ ПО ДОКУМЕНТАМ
	ВыводитьКолонкуВалюта = ПолучитьИспользованиеКолнкиВалюта(Запрос, ВалтаРегУчета);
	//СЧИТАЕМ КОЛИЧЕСТВО ВАЛЮТ ПО ДОКУМЕНТАМ
	
	
	//Вывод шапки таблицы
	ОбластьШапкаТаблицыНачало = Макет.ПолучитьОбласть("ШапкаТаблицы|Начало");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыНачало);
	
	Если ВыводитьКолонкуВалюта Тогда
		ОбластьШапкаТаблицыВалюта = Макет.ПолучитьОбласть("ШапкаТаблицы|Валюта");
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыВалюта);
	КонецЕсли;
	
	Если ВыводитьПараметрДополнительнойГруппировки Тогда
		ОбластьШапкаТаблицыДопГруппировка = Макет.ПолучитьОбласть("ШапкаТаблицы|ДопГруппировка");
		ОбластьШапкаТаблицыДопГруппировка.Параметры.ИмяПараметра = Строка(ПараметрДополнительнойГруппировки);
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыДопГруппировка);
	КонецЕсли;
	
	ОбластьШапкаТаблицыЗатратыПоДокументу = Макет.ПолучитьОбласть("ШапкаТаблицы|ЗатратыПоДокументу");
	ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыЗатратыПоДокументу);
	
	Если ВыводитьКолонкуВалюта Тогда
		ОбластьШапкаТаблицыЗатратыКАкту = Макет.ПолучитьОбласть("ШапкаТаблицы|ЗатратыКАкту");
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыЗатратыКАкту);
	КонецЕсли;
	
	ОбластьШапкаТаблицыЗатратыКАктуРегу = Макет.ПолучитьОбласть("ШапкаТаблицы|ЗатратыКАктуРег");
	ОбластьШапкаТаблицыЗатратыКАктуРегу.Параметры.Валюта 			= ПредставлениеВалюты;
	ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыЗатратыКАктуРегу);
	
	Если ВыводитьПоказателиСправкиВВалютеДокумента Тогда
		ОбластьШапкаТаблицыЗатратыВВалютеКлиента = Макет.ПолучитьОбласть("ШапкаТаблицы|ЗатратыВВалютеКлиента");
		ОбластьШапкаТаблицыЗатратыВВалютеКлиента.Параметры.ВалютаКлиента = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(ВыборкаШапка.Валюта);
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыЗатратыВВалютеКлиента);
	КонецЕсли;
	//Шапка таблицы
	
	
	//Данные таблицы
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Данные.Контрагент КАК Контрагент,
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВТ_Данные.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_Данные.Регистратор КАК Регистратор,
	|	ВТ_Данные.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ВТ_Данные.Валюта КАК Валюта,
	|	ВТ_Данные.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_Данные.РасходыСуммаВсего КАК РасходыСуммаВсего,
	|	ВТ_Данные.РасходыСуммаНДС КАК РасходыСуммаНДС,
	|	ВТ_Данные.РасходыСуммаВсегоВал КАК РасходыСуммаВсегоВал,
	|	ВТ_Данные.РасходыСуммаНДСВал КАК РасходыСуммаНДСВал,
	|	ВТ_Данные.СуммаВсегоВалОбщая КАК СуммаВсегоВалОбщая,
	|	ВТ_Данные.СуммаНДСВалОбщая КАК СуммаНДСВалОбщая,
	|	ВТ_Данные.ДоходыСуммаВсегоВал КАК ДоходыСуммаВсегоВал,
	|	ВТ_Данные.ДоходыСуммаНДСВал КАК ДоходыСуммаНДСВал
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ИТОГИ
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(НоменклатураНаименованиеПолное),
	|	МАКСИМУМ(ПорядокОтражения),
	|	МАКСИМУМ(ПредставлениеДокумента),
	|	МАКСИМУМ(Валюта),
	|	СУММА(РасходыСуммаВсего),
	|	СУММА(РасходыСуммаНДС),
	|	СУММА(РасходыСуммаВсегоВал),
	|	СУММА(РасходыСуммаНДСВал),
	|	МАКСИМУМ(СуммаВсегоВалОбщая),
	|	МАКСИМУМ(СуммаНДСВалОбщая),
	|	СУММА(ДоходыСуммаВсегоВал),
	|	СУММА(ДоходыСуммаНДСВал)
	|ПО
	|	ОБЩИЕ,
	|	Регистратор,
	|	ЗначениеПараметра";
	
	РезультатЗапроса = Запрос.Выполнить();                           
	
	ВыборкаОбщие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщие.Следующий() Тогда
		Нпп = 1;
		
		ВыборкаДокументы  = ВыборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокументы.Следующий() Цикл
			
			ВыборкаЗначенеПараметра = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗначенеПараметра.Следующий() Цикл
				
				ОбластьСтрокаТаблицыНачало = Макет.ПолучитьОбласть("СтрокаТаблицы|Начало");
				
				ОбластьСтрокаТаблицыНачало.Параметры.Заполнить(ВыборкаЗначенеПараметра);
				
				ОбластьСтрокаТаблицыНачало.Параметры.Нпп = Нпп;
				
				//Номенклатура
				мНоменклатура = Новый Массив;
				ВыборкаДетали = ВыборкаЗначенеПараметра.Выбрать();
				Пока ВыборкаДетали.Следующий() Цикл
					
					Если ПустаяСтрока(ВыборкаДетали.НоменклатураНаименованиеПолное) Тогда
						ЗначениеВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаДетали.НоменклатураНаименованиеПолное);
					Иначе
						ЗначениеВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаДетали.Номенклатура);
					КонецЕсли;
					
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мНоменклатура, ЗначениеВМассиве, Истина); 
				КонецЦикла;
				
				ОбластьСтрокаТаблицыНачало.Параметры.Услуги = СтрСоединить(мНоменклатура, ", ");
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыНачало);
				
				Если ВыводитьКолонкуВалюта Тогда
					СтрокаТаблицыВалюта = Макет.ПолучитьОбласть("СтрокаТаблицы|Валюта");
					СтрокаТаблицыВалюта.Параметры.Валюта = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(ВыборкаЗначенеПараметра.Валюта);
					ТабличныйДокумент.Присоединить(СтрокаТаблицыВалюта);
				КонецЕсли;
				
				Если ВыводитьПараметрДополнительнойГруппировки Тогда
					СтрокаТаблицыДопГруппировка = Макет.ПолучитьОбласть("СтрокаТаблицы|ДопГруппировка");
					СтрокаТаблицыДопГруппировка.Параметры.ЗначениеПараметра = ВыборкаЗначенеПараметра.ЗначениеПараметра;
					ТабличныйДокумент.Присоединить(СтрокаТаблицыДопГруппировка);
				КонецЕсли;
				
				ОбластьСтрокаТаблицыЗатратыПоДокументу = Макет.ПолучитьОбласть("СтрокаТаблицы|ЗатратыПоДокументу");
				ОбластьСтрокаТаблицыЗатратыПоДокументу.Параметры.Заполнить(ВыборкаЗначенеПараметра);
				ТабличныйДокумент.Присоединить(ОбластьСтрокаТаблицыЗатратыПоДокументу);
				
				Если ВыводитьКолонкуВалюта Тогда
					СтрокаТаблицыЗатратыКАкту = Макет.ПолучитьОбласть("СтрокаТаблицы|ЗатратыКАкту");
					СтрокаТаблицыЗатратыКАкту.Параметры.Заполнить(ВыборкаЗначенеПараметра);
					ТабличныйДокумент.Присоединить(СтрокаТаблицыЗатратыКАкту);
				КонецЕсли;
				
				СтрокаТаблицыЗатратыКАктуРег = Макет.ПолучитьОбласть("СтрокаТаблицы|ЗатратыКАктуРег");
				СтрокаТаблицыЗатратыКАктуРег.Параметры.Заполнить(ВыборкаЗначенеПараметра);
				ТабличныйДокумент.Присоединить(СтрокаТаблицыЗатратыКАктуРег);
				
				Если ВыводитьПоказателиСправкиВВалютеДокумента Тогда
					СтрокаТаблицыЗатратыВВалютеКлиента = Макет.ПолучитьОбласть("СтрокаТаблицы|ЗатратыВВалютеКлиента");
					СтрокаТаблицыЗатратыВВалютеКлиента.Параметры.Заполнить(ВыборкаЗначенеПараметра);
					
					СтрокаТаблицыЗатратыВВалютеКлиента.Параметры.КурсПерерасчета = КурсПерерасчета;
					
					ТабличныйДокумент.Присоединить(СтрокаТаблицыЗатратыВВалютеКлиента);
				КонецЕсли;
				
				Нпп = Нпп + 1;
			КонецЦикла;
			
		КонецЦикла;
		
		//ОБЩИЕ ИТОГИ
		ОбластьОбщиеИтогиНачало = Макет.ПолучитьОбласть("ПодвалТаблицы|Начало");
		ТабличныйДокумент.Вывести(ОбластьОбщиеИтогиНачало);
		
		Если ВыводитьКолонкуВалюта Тогда
			ПодвалТаблицыВалюта = Макет.ПолучитьОбласть("ПодвалТаблицы|Валюта");
			ТабличныйДокумент.Присоединить(ПодвалТаблицыВалюта);
		КонецЕсли;
		
		Если ВыводитьПараметрДополнительнойГруппировки Тогда
			ПодвалТаблицыДопГруппировка = Макет.ПолучитьОбласть("ПодвалТаблицы|ДопГруппировка");
			ТабличныйДокумент.Присоединить(ПодвалТаблицыДопГруппировка);
		КонецЕсли;
		
		ПодвалТаблицыЗатратыПоДокументу = Макет.ПолучитьОбласть("ПодвалТаблицы|ЗатратыПоДокументу");
		ТабличныйДокумент.Присоединить(ПодвалТаблицыЗатратыПоДокументу);
		
		Если ВыводитьКолонкуВалюта Тогда
			ПодвалТаблицыЗатратыКАкту = Макет.ПолучитьОбласть("ПодвалТаблицы|ЗатратыКАкту");
			ТабличныйДокумент.Присоединить(ПодвалТаблицыЗатратыКАкту);
		КонецЕсли;
		
		ПодвалТаблицыЗатратыКАктуРег = Макет.ПолучитьОбласть("ПодвалТаблицы|ЗатратыКАктуРег");
		ПодвалТаблицыЗатратыКАктуРег.Параметры.Заполнить(ВыборкаОбщие);
		ТабличныйДокумент.Присоединить(ПодвалТаблицыЗатратыКАктуРег);
		
		Если ВыводитьПоказателиСправкиВВалютеДокумента Тогда
			ПодвалТаблицыЗатратыВВалютеКлиента = Макет.ПолучитьОбласть("ПодвалТаблицы|ЗатратыВВалютеКлиента");
			ПодвалТаблицыЗатратыВВалютеКлиента.Параметры.Заполнить(ВыборкаОбщие);
			ТабличныйДокумент.Присоединить(ПодвалТаблицыЗатратыВВалютеКлиента);
		КонецЕсли;
		//ОБЩИЕ ИТОГИ
	КонецЕсли;
	//Данные таблицы
	
	//Дополнительная таблица
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор КАК Регистратор,
	               |	CW_РасходыПоГрузоперевозкам.Контрагент КАК Поставщик,
	               |	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
	               |	CW_РасходыПоГрузоперевозкам.Покупатель КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкам.ДоговорПокупателя КАК Договор,
	               |	CW_РасходыПоГрузоперевозкам.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговору,
	               |	СУММА(CW_РасходыПоГрузоперевозкам.Всего_Валюта) КАК Сумма,
	               |	СУММА(ВЫБОР
	               |			КОГДА CW_РасходыПоГрузоперевозкам.Покупатель = &Контрагент
	               |					И CW_РасходыПоГрузоперевозкам.ДоговорПокупателя = &Договор
	               |					И CW_РасходыПоГрузоперевозкам.ПриложениеКДоговоруПокупателя = &ПриложениеКДоговору
	               |				ТОГДА CW_РасходыПоГрузоперевозкам.Всего_Валюта
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отражено
	               |ИЗ
	               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Регистраторы.Регистратор КАК Регистратор
	               |			ИЗ
	               |				ВТ_Регистраторы КАК ВТ_Регистраторы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_РасходыПоГрузоперевозкам.Регистратор,
	               |	CW_РасходыПоГрузоперевозкам.Покупатель,
	               |	CW_РасходыПоГрузоперевозкам.ДоговорПокупателя,
	               |	CW_РасходыПоГрузоперевозкам.ПриложениеКДоговоруПокупателя,
	               |	CW_РасходыПоГрузоперевозкам.Валюта,
	               |	CW_РасходыПоГрузоперевозкам.Контрагент
	               |ИТОГИ
	               |	МАКСИМУМ(Поставщик),
	               |	МАКСИМУМ(Валюта),
	               |	СУММА(Сумма),
	               |	СУММА(Отражено)
	               |ПО
	               |	Регистратор,
	               |	Контрагент,
	               |	Договор,
	               |	ПриложениеКДоговору";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаРегистратор = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьЗаголовокДоп = Макет.ПолучитьОбласть("ЗаголовокДоп");					
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДоп);
	
	ОбластьШапкаТаблицыДоп = Макет.ПолучитьОбласть("ШапкаТаблицыДоп");					
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыДоп);
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		ОбластьСтрокаДокументДоп = Макет.ПолучитьОбласть("СтрокаДокументДоп");
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаДокументДоп.Параметры, ВыборкаРегистратор);
		
		ОбластьСтрокаДокументДоп.Параметры.ПредставлениеДокумента 	= ВыборкаРегистратор.Регистратор.ПредставлениеДокумента;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаДокументДоп);
		
		ВыборкаКонтрагент = ВыборкаРегистратор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл
			
			ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДоговор.Следующий() Цикл
				
				ВыборкаПриложениеКДоговору = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПриложениеКДоговору.Следующий() Цикл
					
					ОбластьСтрокаДоп = Макет.ПолучитьОбласть("СтрокаДоп");	
					
					ПредставлениеПокупателя = Строка(ВыборкаКонтрагент.Контрагент) 
					+ " ( Дог. №"+ Строка(ВыборкаДоговор.Договор.НомерДоговора)+" от "+ Формат(ВыборкаДоговор.Договор.ДатаДоговора,"ДФ=dd.MM.yyyy");
					
					Если ЗначениеЗаполнено(ВыборкаПриложениеКДоговору.ПриложениеКДоговору) Тогда
						ПредставлениеПокупателя = ПредставлениеПокупателя 
						+ ", Прил. №"+Строка(ВыборкаПриложениеКДоговору.ПриложениеКДоговору.НомерДокумента)+" от "+Формат(ВыборкаПриложениеКДоговору.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy");
					КонецЕсли;
					
					ОбластьСтрокаДоп.Параметры.ПредставлениеПокупателя = ПредставлениеПокупателя;
					ОбластьСтрокаДоп.Параметры.Сумма 		= ВыборкаПриложениеКДоговору.Сумма;
					ОбластьСтрокаДоп.Параметры.Отражено 	= ВыборкаПриложениеКДоговору.Отражено;
					
					ТабличныйДокумент.Вывести(ОбластьСтрокаДоп);
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	//Дополнительная таблица
	
	//Исполнитель документа
	Если Не СсылкаНаОбъект.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяСправкаКАкту Тогда
		
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
		ТелефонИсполнителя = 
		УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Ответственный, 
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя")
		,, Истина);		
		
		ИсполнительФизическоеЛицо 	= СсылкаНаОбъект.Ответственный.ФизическоеЛицо;
		Если ИсполнительФизическоеЛицо.Пустая() Тогда
			Исполнитель = "";
		Иначе
			Исполнитель = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИсполнительФизическоеЛицо);
		КонецЕсли;
		
		ОбластьИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
		ОбластьИсполнитель.Параметры.Исполнитель 		= "Исп. "+ Исполнитель;
		ОбластьИсполнитель.Параметры.ТелефонИсполнителя = "Тел. "+ ТелефонИсполнителя;
		
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
	КонецЕсли;
	//Исполнитель документа
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции

Функция ПолучитьИспользованиеКолнкиВалюта(Запрос, Знач ВалтаРегУчета)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Регистраторы.Валюта КАК Валюта
	|ИЗ
	|	ВТ_Регистраторы КАК ВТ_Регистраторы
	|ГДЕ
	|	ВТ_Регистраторы.Валюта <> &ВалтаРегУчета";
	
	Запрос.УстановитьПараметр("ВалтаРегУчета", ВалтаРегУчета);
	РеузльтатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РеузльтатЗапроса.Пустой()
	
КонецФункции


//ЗАПРОСЫ
Процедура ДополнитьВЗапросДанныеПоДоходам(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	|	CW_ДоходыПоГрузоперевозкам.Договор КАК Договор,
	|	CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	CW_ДоходыПоГрузоперевозкам.ДокументРасходов КАК ДокументРасходов,
	|	CW_ДоходыПоГрузоперевозкам.ПорядокОтражения КАК ПорядокОтражения,
	|	CW_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
	|	CW_ДоходыПоГрузоперевозкам.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ЕСТЬNULL(CW_СоставГруппУслуг.ГруппаУслуг, НЕОПРЕДЕЛЕНО) КАК ГруппаУслуг,
	|	CW_ДоходыПоГрузоперевозкам.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_ДанныеДоходов
	|ИЗ
	|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	|		ПО CW_ДоходыПоГрузоперевозкам.Номенклатура = CW_СоставГруппУслуг.Услуга
	|			И (ВЫБОР
	|				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка)
	|					ТОГДА CW_ДоходыПоГрузоперевозкам.Договор = CW_СоставГруппУслуг.Владелец
	|				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = CW_СоставГруппУслуг.Владелец
	|			КОНЕЦ)
	|			И (CW_ДоходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга))
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкам.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкам.ПорядокОтражения,
	|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка,
	|	CW_ДоходыПоГрузоперевозкам.ДокументРасходов,
	|	CW_ДоходыПоГрузоперевозкам.Номенклатура,
	|	CW_ДоходыПоГрузоперевозкам.Валюта,
	|	CW_ДоходыПоГрузоперевозкам.Договор,
	|	CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору,
	|	ЕСТЬNULL(CW_СоставГруппУслуг.ГруппаУслуг, НЕОПРЕДЕЛЕНО),
	|	CW_ДоходыПоГрузоперевозкам.Номенклатура.НаименованиеПолное
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеДоходов.Грузоперевозка КАК Грузоперевозка,
	|	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	ВТ_ДанныеДоходов КАК ВТ_ДанныеДоходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|		ПО ВТ_ДанныеДоходов.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
	|			И (CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДоходов.Грузоперевозка,
	|	CW_ХарактеристикиГрузоперевозок.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.Грузоперевозка.Заказ КАК Заказ,
	|	ВТ_Грузоперевозки.Грузоперевозка КАК Грузоперевозка
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|ГДЕ
	|	ВТ_Грузоперевозки.Грузоперевозка.Заказ <> ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Грузоперевозка КАК Грузоперевозка,
	|	ЕСТЬNULL(CW_ХарактеристикиЗаказов.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	|ПОМЕСТИТЬ ВТ_ХарактеристикиЗаказов
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	|		ПО ВТ_Заказы.Заказ = CW_ХарактеристикиЗаказов.Заказ
	|			И (CW_ХарактеристикиЗаказов.Параметр = &Параметр)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Грузоперевозка,
	|	ЕСТЬNULL(CW_ХарактеристикиЗаказов.Значение, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.Грузоперевозка КАК Грузоперевозка,
	|	ЕСТЬNULL(ВТ_Грузоперевозки.Значение, ВТ_ХарактеристикиЗаказов.Значение) КАК ЗначениеПараметра
	|ПОМЕСТИТЬ ВТ_ЗначенияПараметраГрузоперевозок
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиЗаказов КАК ВТ_ХарактеристикиЗаказов
	|		ПО ВТ_Грузоперевозки.Грузоперевозка = ВТ_ХарактеристикиЗаказов.Грузоперевозка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДоходов.Грузоперевозка КАК Грузоперевозка,
	|	ЕСТЬNULL(ВТ_ЗначенияПараметраГрузоперевозок.ЗначениеПараметра, НЕОПРЕДЕЛЕНО) КАК ЗначениеПараметра,
	|	ВТ_ДанныеДоходов.Договор КАК Договор,
	|	ВТ_ДанныеДоходов.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_ДанныеДоходов.ДокументРасходов КАК ДокументРасходов,
	|	ВТ_ДанныеДоходов.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_ДанныеДоходов.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеДоходов.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВТ_ДанныеДоходов.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТ_ДанныеДоходов.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_ДоходыПоГрузоперевозкам
	|ИЗ
	|	ВТ_ДанныеДоходов КАК ВТ_ДанныеДоходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПараметраГрузоперевозок КАК ВТ_ЗначенияПараметраГрузоперевозок
	|		ПО ВТ_ДанныеДоходов.Грузоперевозка = ВТ_ЗначенияПараметраГрузоперевозок.Грузоперевозка";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьВЗапросДанныеПоПеревыставляемымЗатратам(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор КАК Регистратор,
	               |	CW_РасходыПоГрузоперевозкам.Регистратор.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА CW_РасходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление)
	               |		КОГДА CW_РасходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам)
	               |	КОНЕЦ КАК ПорядокОтражения,
	               |	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
	               |	СУММА(CW_РасходыПоГрузоперевозкам.Всего) КАК РасходыСуммаВсего,
	               |	СУММА(CW_РасходыПоГрузоперевозкам.НДС) КАК РасходыСуммаНДС,
	               |	СУММА(CW_РасходыПоГрузоперевозкам.Всего_Валюта) КАК РасходыСуммаВсегоВал,
	               |	СУММА(ВЫРАЗИТЬ(CW_РасходыПоГрузоперевозкам.Всего_Валюта * (CW_РасходыПоГрузоперевозкам.НДС / CW_РасходыПоГрузоперевозкам.Всего) КАК ЧИСЛО(10, 2))) КАК РасходыСуммаНДСВал
	               |ПОМЕСТИТЬ ВТ_ПеревыставляемыеЗатарты
	               |ИЗ
	               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДоходыПоГрузоперевозкам.ДокументРасходов КАК ДокументРасходов
	               |			ИЗ
	               |				ВТ_ДоходыПоГрузоперевозкам КАК ВТ_ДоходыПоГрузоперевозкам)
	               |	И CW_РасходыПоГрузоперевозкам.ПорядокОтражения В(&мПеревыставление)
	               |	И CW_РасходыПоГрузоперевозкам.ЭтоАкт = ИСТИНА
	               |	И CW_РасходыПоГрузоперевозкам.Покупатель = &Контрагент
	               |	И CW_РасходыПоГрузоперевозкам.ДоговорПокупателя = &Договор
	               |	И CW_РасходыПоГрузоперевозкам.ПриложениеКДоговоруПокупателя = &ПриложениеКДоговору
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_РасходыПоГрузоперевозкам.Регистратор,
	               |	CW_РасходыПоГрузоперевозкам.Валюта,
	               |	CW_РасходыПоГрузоперевозкам.Контрагент,
	               |	CW_РасходыПоГрузоперевозкам.Номенклатура,
	               |	CW_РасходыПоГрузоперевозкам.Регистратор.ПредставлениеДокумента,
	               |	ВЫБОР
	               |		КОГДА CW_РасходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление)
	               |		КОГДА CW_РасходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам)
	               |	КОНЕЦ,
	               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьГруппыУслугДляполученияПрямыхЗатрат(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ДоходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_ДоходыПоГрузоперевозкам.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТ_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ГруппыУслугНоменклатуры
	|ИЗ
	|	ВТ_ДоходыПоГрузоперевозкам КАК ВТ_ДоходыПоГрузоперевозкам
	|ГДЕ
	|	ВТ_ДоходыПоГрузоперевозкам.ГруппаУслуг <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДоходыПоГрузоперевозкам.Номенклатура,
	|	ВТ_ДоходыПоГрузоперевозкам.ГруппаУслуг,
	|	ВТ_ДоходыПоГрузоперевозкам.Грузоперевозка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппыУслугНоменклатуры.Грузоперевозка КАК Грузоперевозка,
	|	CW_СоставГруппУслуг.Услуга КАК Номенклатура,
	|	CW_СоставГруппУслуг.ГруппаУслуг КАК ГруппаУслуг
	|ПОМЕСТИТЬ ВТ_ДанныеДляПолученияПрямыхЗатрат
	|ИЗ
	|	ВТ_ГруппыУслугНоменклатуры КАК ВТ_ГруппыУслугНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	|		ПО ВТ_ГруппыУслугНоменклатуры.ГруппаУслуг = CW_СоставГруппУслуг.ГруппаУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НоменклатураПоГрузоперевозкам
	|ИЗ
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат КАК ВТ_ДанныеДляПолученияПрямыхЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.Грузоперевозка,
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.ГруппаУслуг КАК ГруппаУслуг,
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_НоменклатураГруппУслуг
	|ИЗ
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат КАК ВТ_ДанныеДляПолученияПрямыхЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.ГруппаУслуг,
	|	ВТ_ДанныеДляПолученияПрямыхЗатрат.Номенклатура";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьПрямыеЗатраты(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор КАК Регистратор,
	               |	CW_РасходыПоГрузоперевозкам.Регистратор.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
	               |	CW_РасходыПоГрузоперевозкам.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	               |	ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга) КАК ПорядокОтражения,
	               |	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
	               |	CW_РасходыПоГрузоперевозкам.Всего КАК ЗатратыСуммаВсего,
	               |	CW_РасходыПоГрузоперевозкам.НДС КАК ЗатратыСуммаНДС,
	               |	CW_РасходыПоГрузоперевозкам.Всего_Валюта КАК ЗатратыСуммаВсегоВал,
	               |	ВЫБОР
	               |		КОГДА CW_РасходыПоГрузоперевозкам.Всего_Валюта = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫРАЗИТЬ(CW_РасходыПоГрузоперевозкам.Всего_Валюта * (CW_РасходыПоГрузоперевозкам.НДС / CW_РасходыПоГрузоперевозкам.Всего_Валюта) КАК ЧИСЛО(10, 2))
	               |	КОНЕЦ КАК ЗатратыСуммаНДСВал
	               |ПОМЕСТИТЬ ВТ_ДанныеПрямыхЗатрат
	               |ИЗ
	               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |ГДЕ
	               |	(CW_РасходыПоГрузоперевозкам.Грузоперевозка, CW_РасходыПоГрузоперевозкам.Номенклатура) В
	               |			(ВЫБРАТЬ
	               |				ВТ_НоменклатураПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
	               |				ВТ_НоменклатураПоГрузоперевозкам.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				ВТ_НоменклатураПоГрузоперевозкам КАК ВТ_НоменклатураПоГрузоперевозкам)
	               |	И CW_РасходыПоГрузоперевозкам.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.Затраты)
	               |	И CW_РасходыПоГрузоперевозкам.ЭтоАкт = ИСТИНА
	               |	И CW_РасходыПоГрузоперевозкам.Покупатель = &Контрагент
	               |	И CW_РасходыПоГрузоперевозкам.ДоговорПокупателя = &Договор
	               |	И CW_РасходыПоГрузоперевозкам.ПриложениеКДоговоруПокупателя = &ПриложениеКДоговору
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПрямыхЗатрат.Регистратор КАК Регистратор,
	               |	ВТ_ДанныеПрямыхЗатрат.ПредставлениеДокумента КАК ПредставлениеДокумента,
	               |	ВТ_ДанныеПрямыхЗатрат.Контрагент КАК Контрагент,
	               |	ВТ_ДанныеПрямыхЗатрат.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_ДанныеПрямыхЗатрат.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеПрямыхЗатрат.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	               |	ВТ_ДанныеПрямыхЗатрат.ПорядокОтражения КАК ПорядокОтражения,
	               |	ВТ_ДанныеПрямыхЗатрат.Валюта КАК Валюта,
	               |	СУММА(ВТ_ДанныеПрямыхЗатрат.ЗатратыСуммаВсего) КАК ЗатратыСуммаВсего,
	               |	СУММА(ВТ_ДанныеПрямыхЗатрат.ЗатратыСуммаНДС) КАК ЗатратыСуммаНДС,
	               |	СУММА(ВТ_ДанныеПрямыхЗатрат.ЗатратыСуммаВсегоВал) КАК ЗатратыСуммаВсегоВал,
	               |	СУММА(ВТ_ДанныеПрямыхЗатрат.ЗатратыСуммаНДСВал) КАК ЗатратыСуммаНДСВал,
	               |	ЕСТЬNULL(ВТ_НоменклатураГруппУслуг.ГруппаУслуг, НЕОПРЕДЕЛЕНО) КАК ГруппаУслуг
	               |ПОМЕСТИТЬ ВТ_ПрямыеЗатраты
	               |ИЗ
	               |	ВТ_ДанныеПрямыхЗатрат КАК ВТ_ДанныеПрямыхЗатрат
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатураГруппУслуг КАК ВТ_НоменклатураГруппУслуг
	               |		ПО ВТ_ДанныеПрямыхЗатрат.Номенклатура = ВТ_НоменклатураГруппУслуг.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеПрямыхЗатрат.ПорядокОтражения,
	               |	ВТ_ДанныеПрямыхЗатрат.Регистратор,
	               |	ВТ_ДанныеПрямыхЗатрат.ПредставлениеДокумента,
	               |	ВТ_ДанныеПрямыхЗатрат.Контрагент,
	               |	ВТ_ДанныеПрямыхЗатрат.Валюта,
	               |	ЕСТЬNULL(ВТ_НоменклатураГруппУслуг.ГруппаУслуг, НЕОПРЕДЕЛЕНО),
	               |	ВТ_ДанныеПрямыхЗатрат.Грузоперевозка,
	               |	ВТ_ДанныеПрямыхЗатрат.Номенклатура,
	               |	ВТ_ДанныеПрямыхЗатрат.НоменклатураНаименованиеПолное";
	
	Запрос.Выполнить();    
	
КонецПроцедуры

Процедура ПолучитьРасходныеДокументыКАкту(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ПрямыеЗатраты.Регистратор КАК Регистратор,
	|	ВТ_ПрямыеЗатраты.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	ВТ_ПрямыеЗатраты КАК ВТ_ПрямыеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПеревыставляемыеЗатарты.Регистратор,
	|	ВТ_ПеревыставляемыеЗатарты.Валюта
	|ИЗ
	|	ВТ_ПеревыставляемыеЗатарты КАК ВТ_ПеревыставляемыеЗатарты";
	
	
	Запрос.Выполнить();    
	
КонецПроцедуры

Процедура ДополнитьВЗапросИтогиПоРасходнымДокументам(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор КАК Регистратор,
	               |	СУММА(CW_РасходыПоГрузоперевозкам.Всего_Валюта) КАК СуммаВсегоВалОбщая,
	               |	СУММА(ВЫБОР
	               |			КОГДА CW_РасходыПоГрузоперевозкам.Всего = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ВЫРАЗИТЬ(CW_РасходыПоГрузоперевозкам.Всего_Валюта * (CW_РасходыПоГрузоперевозкам.НДС / CW_РасходыПоГрузоперевозкам.Всего) КАК ЧИСЛО(10, 2))
	               |		КОНЕЦ) КАК СуммаНДСВалОбщая
	               |ПОМЕСТИТЬ ВТ_ИтогиПоДокументам
	               |ИЗ
	               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкам.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Регистраторы.Регистратор КАК Регистратор
	               |			ИЗ
	               |				ВТ_Регистраторы КАК ВТ_Регистраторы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_РасходыПоГрузоперевозкам.Регистратор";
	
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьДанныеВходящихДокументов(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ПеревыставляемыеЗатарты.Контрагент КАК Контрагент,
	|	ВТ_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
	|	ВТ_ДоходыПоГрузоперевозкам.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_ДоходыПоГрузоперевозкам.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВТ_ДоходыПоГрузоперевозкам.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_ПеревыставляемыеЗатарты.Регистратор КАК Регистратор,
	|	ВТ_ПеревыставляемыеЗатарты.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ВТ_ПеревыставляемыеЗатарты.Валюта КАК Валюта,
	|	ВТ_ПеревыставляемыеЗатарты.РасходыСуммаВсего КАК РасходыСуммаВсего,
	|	ВТ_ПеревыставляемыеЗатарты.РасходыСуммаНДС КАК РасходыСуммаНДС,
	|	ВТ_ПеревыставляемыеЗатарты.РасходыСуммаВсегоВал КАК РасходыСуммаВсегоВал,
	|	ВТ_ПеревыставляемыеЗатарты.РасходыСуммаНДСВал КАК РасходыСуммаНДСВал,
	|	ВТ_ИтогиПоДокументам.СуммаВсегоВалОбщая КАК СуммаВсегоВалОбщая,
	|	ВТ_ИтогиПоДокументам.СуммаНДСВалОбщая КАК СуммаНДСВалОбщая,
	|	ВЫРАЗИТЬ(ВТ_ПеревыставляемыеЗатарты.РасходыСуммаВсего / &КурсПерерасчета КАК ЧИСЛО(10, 2)) КАК ДоходыСуммаВсегоВал,
	|	ВЫРАЗИТЬ(ВТ_ПеревыставляемыеЗатарты.РасходыСуммаНДС / &КурсПерерасчета КАК ЧИСЛО(10, 2)) КАК ДоходыСуммаНДСВал
	|ПОМЕСТИТЬ ВТ_Перевыставление
	|ИЗ
	|	ВТ_ДоходыПоГрузоперевозкам КАК ВТ_ДоходыПоГрузоперевозкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПеревыставляемыеЗатарты КАК ВТ_ПеревыставляемыеЗатарты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПоДокументам КАК ВТ_ИтогиПоДокументам
	|			ПО ВТ_ПеревыставляемыеЗатарты.Регистратор = ВТ_ИтогиПоДокументам.Регистратор
	|		ПО ВТ_ДоходыПоГрузоперевозкам.ДокументРасходов = ВТ_ПеревыставляемыеЗатарты.Регистратор
	|			И ВТ_ДоходыПоГрузоперевозкам.Номенклатура = ВТ_ПеревыставляемыеЗатарты.Номенклатура
	|			И ВТ_ДоходыПоГрузоперевозкам.ПорядокОтражения = ВТ_ПеревыставляемыеЗатарты.ПорядокОтражения
	|			И ВТ_ДоходыПоГрузоперевозкам.Грузоперевозка = ВТ_ПеревыставляемыеЗатарты.Грузоперевозка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПрямыеЗатраты.Контрагент КАК Контрагент,
	|	ВТ_ПрямыеЗатраты.Номенклатура КАК Номенклатура,
	|	ВТ_ПрямыеЗатраты.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВТ_ДоходыПоГрузоперевозкам.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_ДоходыПоГрузоперевозкам.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_ПрямыеЗатраты.Регистратор КАК Регистратор,
	|	ВТ_ПрямыеЗатраты.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ВТ_ПрямыеЗатраты.Валюта КАК Валюта,
	|	ВТ_ПрямыеЗатраты.ЗатратыСуммаВсего КАК РасходыСуммаВсего,
	|	ВТ_ПрямыеЗатраты.ЗатратыСуммаНДС КАК РасходыСуммаНДС,
	|	ВТ_ПрямыеЗатраты.ЗатратыСуммаВсегоВал КАК РасходыСуммаВсегоВал,
	|	ВТ_ПрямыеЗатраты.ЗатратыСуммаНДСВал КАК РасходыСуммаНДСВал,
	|	ВТ_ИтогиПоДокументам.СуммаВсегоВалОбщая КАК СуммаВсегоВалОбщая,
	|	ВТ_ИтогиПоДокументам.СуммаНДСВалОбщая КАК СуммаНДСВалОбщая,
	|	ВЫРАЗИТЬ(ВТ_ПрямыеЗатраты.ЗатратыСуммаВсего / &КурсПерерасчета КАК ЧИСЛО(10, 2)) КАК ДоходыСуммаВсегоВал,
	|	ВЫРАЗИТЬ(ВТ_ПрямыеЗатраты.ЗатратыСуммаНДС / &КурсПерерасчета КАК ЧИСЛО(10, 2)) КАК ДоходыСуммаНДСВал
	|ПОМЕСТИТЬ ВТ_Затраты
	|ИЗ
	|	ВТ_ДоходыПоГрузоперевозкам КАК ВТ_ДоходыПоГрузоперевозкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПрямыеЗатраты КАК ВТ_ПрямыеЗатраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиПоДокументам КАК ВТ_ИтогиПоДокументам
	|			ПО ВТ_ПрямыеЗатраты.Регистратор = ВТ_ИтогиПоДокументам.Регистратор
	|		ПО ВТ_ДоходыПоГрузоперевозкам.ГруппаУслуг = ВТ_ПрямыеЗатраты.ГруппаУслуг
	|			И ВТ_ДоходыПоГрузоперевозкам.ПорядокОтражения = ВТ_ПрямыеЗатраты.ПорядокОтражения
	|			И ВТ_ДоходыПоГрузоперевозкам.Грузоперевозка = ВТ_ПрямыеЗатраты.Грузоперевозка";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьВходящиеДанные(Запрос) 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Перевыставление.Контрагент КАК Контрагент,
	|	ВТ_Перевыставление.Номенклатура КАК Номенклатура,
	|	ВТ_Перевыставление.НоменклатураНаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВТ_Перевыставление.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_Перевыставление.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_Перевыставление.Регистратор КАК Регистратор,
	|	ВТ_Перевыставление.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ВТ_Перевыставление.Валюта КАК Валюта,
	|	ВТ_Перевыставление.РасходыСуммаВсего КАК РасходыСуммаВсего,
	|	ВТ_Перевыставление.РасходыСуммаНДС КАК РасходыСуммаНДС,
	|	ВТ_Перевыставление.РасходыСуммаВсегоВал КАК РасходыСуммаВсегоВал,
	|	ВТ_Перевыставление.РасходыСуммаНДСВал КАК РасходыСуммаНДСВал,
	|	ВТ_Перевыставление.СуммаВсегоВалОбщая КАК СуммаВсегоВалОбщая,
	|	ВТ_Перевыставление.СуммаНДСВалОбщая КАК СуммаНДСВалОбщая,
	|	ВТ_Перевыставление.ДоходыСуммаВсегоВал КАК ДоходыСуммаВсегоВал,
	|	ВТ_Перевыставление.ДоходыСуммаНДСВал КАК ДоходыСуммаНДСВал
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_Перевыставление КАК ВТ_Перевыставление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Затраты.Контрагент,
	|	ВТ_Затраты.Номенклатура,
	|	ВТ_Затраты.НоменклатураНаименованиеПолное,
	|	ВТ_Затраты.ЗначениеПараметра КАК ЗначениеПараметра,
	|	ВТ_Затраты.ПорядокОтражения,
	|	ВТ_Затраты.Регистратор,
	|	ВТ_Затраты.ПредставлениеДокумента,
	|	ВТ_Затраты.Валюта,
	|	ВТ_Затраты.РасходыСуммаВсего,
	|	ВТ_Затраты.РасходыСуммаНДС,
	|	ВТ_Затраты.РасходыСуммаВсегоВал,
	|	ВТ_Затраты.РасходыСуммаНДСВал,
	|	ВТ_Затраты.СуммаВсегоВалОбщая,
	|	ВТ_Затраты.СуммаНДСВалОбщая,
	|	ВТ_Затраты.ДоходыСуммаВсегоВал,
	|	ВТ_Затраты.ДоходыСуммаНДСВал
	|ИЗ
	|	ВТ_Затраты КАК ВТ_Затраты";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПолучитьКурсПересчетаПоТекущемуДокументу()
	
	КурсПерерасчета = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкам.Регистратор КАК Регистратор,
	|	СУММА(CW_ДоходыПоГрузоперевозкам.Всего) КАК Всего,
	|	СУММА(CW_ДоходыПоГрузоперевозкам.Всего_Валюта) КАК ВсегоВал
	|ИЗ
	|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкам.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкам.Регистратор";
	Запрос.УстановитьПараметр("Регистратор", СсылкаНаОбъект);
	
	РезультатЗапроса = запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		КурсПерерасчета = Окр(Выборка.Всего / Выборка.ВсегоВал, 4);
	КонецЕсли;
	
	Возврат КурсПерерасчета;
	
КонецФункции

Процедура ПроверитьНаличиеВходящихДокументов(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Регистраторы.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_Регистраторы КАК ВТ_Регистраторы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Регистраторы.Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Нет данных для формирования отчета";
	КонецЕсли;
	
КонецПроцедуры

//ЗАПРОСЫ


#КонецЕсли
